This is not a fix, more of a workaround. I'm facing the same issue where 

```hcl
 <= data "confluent_schema_registry_cluster" "schema_registry" {
      + api_version           = (known after apply)
      + catalog_endpoint      = (known after apply)
      + cloud                 = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + kind                  = (known after apply)
      + package               = (known after apply)
      + private_rest_endpoint = (known after apply)
      + region                = (known after apply)
      + resource_name         = (known after apply)
      + rest_endpoint         = (known after apply)

      + environment {
          + id = "redacted"
        }
    }
```

is triggering the recreation of 

```hcl
-/+ resource "confluent_api_key" "api-key" {
      ~ id                     = "redacted" -> (known after apply)
      ~ secret                 = (sensitive value)
        # (3 unchanged attributes hidden)

      ~ managed_resource (known after apply) # forces replacement
      - managed_resource { # forces replacement
          - api_version = "srcm/v2" -> null
          - id          = "redacted" -> null
          - kind        = "Cluster" -> null

          - environment {
              - id = "redacted" -> null
            }
        }

        # (1 unchanged block hidden)
    }
```

AND

```hcl

-/+ resource "confluent_schema_registry_cluster_config" "schema-registry" {
      + compatibility_group = (known after apply)
      ~ id                  = "redacted" -> (known after apply)
      ~ rest_endpoint       = "redacted" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      ~ credentials {
          ~ key    = (sensitive value)
          ~ secret = (sensitive value)
        }

      ~ schema_registry_cluster {
          ~ id = "redacted" -> (known after apply) # forces replacement
        }
    }

```

It only happens when tf is applied from one user to another user. For example, first run through a pipeline and then second run through local machine. Can this issue be reopened please

confluent provider version: 2.20.0